###  Part # 1
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  [command]/home/runner/work/_temp/d3f350ed-98d4-49af-a244-b4f8d61dbd61/terraform-bin show -no-color tf.plan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.linux_vm[0] will be created
  + resource "aws_instance" "linux_vm" {
      + ami                                  = "ami-09e4ba81d75ebeb6a"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "linux_key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Environment" = "Test"
          + "Name"        = "week7-dev-LinuxServer-0"
          + "Owner"       = "ACS730"
          + "Project"     = "Ansible"
        }
      + tags_all                             = {
          + "Environment" = "Test"
          + "Name"        = "week7-dev-LinuxServer-0"
          + "Owner"       = "ACS730"
          + "Project"     = "Ansible"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_instance.linux_vm[1] will be created
  + resource "aws_instance" "linux_vm" {
      + ami                                  = "ami-09e4ba81d75ebeb6a"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "linux_key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Environment" = "Test"
          + "Name"        = "week7-dev-LinuxServer-1"
          + "Owner"       = "ACS730"
          + "Project"     = "Ansible"
        }
      + tags_all                             = {
          + "Environment" = "Test"
          + "Name"        = "week7-dev-LinuxServer-1"
          + "Owner"       = "ACS730"
          + "Project"     = "Ansible"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_key_pair.linux_key will be created
  + resource "aws_key_pair" "linux_key" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "linux_key"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDnr0IBON5DDI8avy+YCZVZjRhmlMeW8gU/5RBJVOhhCMk7sRI6zQKJ0eDZfe3UGn1Bn1A18Pyuv/hUR8PUPZTLbXqZAtTJ0PySQotrAi3qvZXp68NU8IAZljVC7uZ2O8ipk9jkbHLxrMk4K0j/7yN4t1C5ReXrCH7XwSh241ibS6KJnmFnqK1QuENS7FC8JlseRr/FRN4b69ekAE1YeNt2TmC4NQndePNd8uzQB2ZAmklsLF35zAr63H7PEVZSRxO1AVMeqVp+DvySs7eBFqw+GmnLaHrqUA6xnr/uRZ+eB4/TiP4embxHEZlX9O6t7DPquxYaprE697ISG/VZ/OkO8gpOSyVYkchd0wH1a0EC1cxkbTlgO4kTgzFj3tpPuQwvd913gsmAE+Y1w5h1Zc/0dHsu1U7xtf8HnIaplTPtZVfG3MLKsTROqU207oT9S+2waVr4I21mgvzsJP6cIXH2KhJPG17zXUcM+cnRyoXedkZZuqNRP2lBAtjkWyBCbU8= fu-haojie@fu-haojies-MacBook-Pro.local"
      + tags            = {
          + "Environment" = "Test"
          + "Name"        = "week7-dev-keypair"
          + "Owner"       = "ACS730"
          + "Project"     = "Ansible"
        }
      + tags_all        = {
          + "Environment" = "Test"
          + "Name"        = "week7-dev-keypair"
          + "Owner"       = "ACS730"
          + "Project"     = "Ansible"
        }
    }

  # module.linux_sg.aws_security_group.default[0] will be created
  + resource "aws_security_group" "default" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "primary"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Attributes"  = "primary"
          + "Environment" = "Test"
          + "Name"        = "week7-dev-LinuxServer-sg"
          + "Owner"       = "ACS730"
          + "Project"     = "Ansible"
        }
      + tags_all               = {
          + "Attributes"  = "primary"
          + "Environment" = "Test"
          + "Name"        = "week7-dev-LinuxServer-sg"
          + "Owner"       = "ACS730"
          + "Project"     = "Ansible"
        }
      + vpc_id                 = "vpc-01a65784cedcde8cb"

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.linux_sg.aws_security_group_rule.keyed["HTTP"] will be created
  + resource "aws_security_group_rule" "keyed" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow HTTP from anywhere"
      + from_port                = 80
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.linux_sg.aws_security_group_rule.keyed["_allow_all_egress_"] will be created
  + resource "aws_security_group_rule" "keyed" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow all egress"
      + from_port                = 0
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.linux_sg.aws_security_group_rule.keyed["ssh"] will be created
  + resource "aws_security_group_rule" "keyed" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow SSH from anywhere"
      + from_port                = 22
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ips = [
      + (known after apply),
      + (known after apply),
    ]
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_instance.linux_vm[0] will be created%0A  + resource "aws_instance" "linux_vm" {%0A      + ami                                  = "ami-09e4ba81d75ebeb6a"%0A      + arn                                  = (known after apply)%0A      + associate_public_ip_address          = (known after apply)%0A      + availability_zone                    = (known after apply)%0A      + cpu_core_count                       = (known after apply)%0A      + cpu_threads_per_core                 = (known after apply)%0A      + disable_api_termination              = (known after apply)%0A      + ebs_optimized                        = (known after apply)%0A      + get_password_data                    = false%0A      + host_id                              = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_initiated_shutdown_behavior = (known after apply)%0A      + instance_state                       = (known after apply)%0A      + instance_type                        = "t2.micro"%0A      + ipv6_address_count                   = (known after apply)%0A      + ipv6_addresses                       = (known after apply)%0A      + key_name                             = "linux_key"%0A      + monitoring                           = (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      + placement_partition_number           = (known after apply)%0A      + primary_network_interface_id         = (known after apply)%0A      + private_dns                          = (known after apply)%0A      + private_ip                           = (known after apply)%0A      + public_dns                           = (known after apply)%0A      + public_ip                            = (known after apply)%0A      + secondary_private_ips                = (known after apply)%0A      + security_groups                      = (known after apply)%0A      + source_dest_check                    = true%0A      + subnet_id                            = (known after apply)%0A      + tags                                 = {%0A          + "Environment" = "Test"%0A          + "Name"        = "week7-dev-LinuxServer-0"%0A          + "Owner"       = "ACS730"%0A          + "Project"     = "Ansible"%0A        }%0A      + tags_all                             = {%0A          + "Environment" = "Test"%0A          + "Name"        = "week7-dev-LinuxServer-0"%0A          + "Owner"       = "ACS730"%0A          + "Project"     = "Ansible"%0A        }%0A      + tenancy                              = (known after apply)%0A      + user_data                            = (known after apply)%0A      + user_data_base64                     = (known after apply)%0A      + vpc_security_group_ids               = (known after apply)%0A%0A      + capacity_reservation_specification {%0A          + capacity_reservation_preference = (known after apply)%0A%0A          + capacity_reservation_target {%0A              + capacity_reservation_id = (known after apply)%0A            }%0A        }%0A%0A      + ebs_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + snapshot_id           = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A%0A      + enclave_options {%0A          + enabled = (known after apply)%0A        }%0A%0A      + ephemeral_block_device {%0A          + device_name  = (known after apply)%0A          + no_device    = (known after apply)%0A          + virtual_name = (known after apply)%0A        }%0A%0A      + metadata_options {%0A          + http_endpoint               = (known after apply)%0A          + http_put_response_hop_limit = (known after apply)%0A          + http_tokens                 = (known after apply)%0A          + instance_metadata_tags      = (known after apply)%0A        }%0A%0A      + network_interface {%0A          + delete_on_termination = (known after apply)%0A          + device_index          = (known after apply)%0A          + network_interface_id  = (known after apply)%0A        }%0A%0A      + root_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A    }%0A%0A  # aws_instance.linux_vm[1] will be created%0A  + resource "aws_instance" "linux_vm" {%0A      + ami                                  = "ami-09e4ba81d75ebeb6a"%0A      + arn                                  = (known after apply)%0A      + associate_public_ip_address          = (known after apply)%0A      + availability_zone                    = (known after apply)%0A      + cpu_core_count                       = (known after apply)%0A      + cpu_threads_per_core                 = (known after apply)%0A      + disable_api_termination              = (known after apply)%0A      + ebs_optimized                        = (known after apply)%0A      + get_password_data                    = false%0A      + host_id                              = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_initiated_shutdown_behavior = (known after apply)%0A      + instance_state                       = (known after apply)%0A      + instance_type                        = "t2.micro"%0A      + ipv6_address_count                   = (known after apply)%0A      + ipv6_addresses                       = (known after apply)%0A      + key_name                             = "linux_key"%0A      + monitoring                           = (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      + placement_partition_number           = (known after apply)%0A      + primary_network_interface_id         = (known after apply)%0A      + private_dns                          = (known after apply)%0A      + private_ip                           = (known after apply)%0A      + public_dns                           = (known after apply)%0A      + public_ip                            = (known after apply)%0A      + secondary_private_ips                = (known after apply)%0A      + security_groups                      = (known after apply)%0A      + source_dest_check                    = true%0A      + subnet_id                            = (known after apply)%0A      + tags                                 = {%0A          + "Environment" = "Test"%0A          + "Name"        = "week7-dev-LinuxServer-1"%0A          + "Owner"       = "ACS730"%0A          + "Project"     = "Ansible"%0A        }%0A      + tags_all                             = {%0A          + "Environment" = "Test"%0A          + "Name"        = "week7-dev-LinuxServer-1"%0A          + "Owner"       = "ACS730"%0A          + "Project"     = "Ansible"%0A        }%0A      + tenancy                              = (known after apply)%0A      + user_data                            = (known after apply)%0A      + user_data_base64                     = (known after apply)%0A      + vpc_security_group_ids               = (known after apply)%0A%0A      + capacity_reservation_specification {%0A          + capacity_reservation_preference = (known after apply)%0A%0A          + capacity_reservation_target {%0A              + capacity_reservation_id = (known after apply)%0A            }%0A        }%0A%0A      + ebs_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + snapshot_id           = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A%0A      + enclave_options {%0A          + enabled = (known after apply)%0A        }%0A%0A      + ephemeral_block_device {%0A          + device_name  = (known after apply)%0A          + no_device    = (known after apply)%0A          + virtual_name = (known after apply)%0A        }%0A%0A      + metadata_options {%0A          + http_endpoint               = (known after apply)%0A          + http_put_response_hop_limit = (known after apply)%0A          + http_tokens                 = (known after apply)%0A          + instance_metadata_tags      = (known after apply)%0A        }%0A%0A      + network_interface {%0A          + delete_on_termination = (known after apply)%0A          + device_index          = (known after apply)%0A          + network_interface_id  = (known after apply)%0A        }%0A%0A      + root_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A    }%0A%0A  # aws_key_pair.linux_key will be created%0A  + resource "aws_key_pair" "linux_key" {%0A      + arn             = (known after apply)%0A      + fingerprint     = (known after apply)%0A      + id              = (known after apply)%0A      + key_name        = "linux_key"%0A      + key_name_prefix = (known after apply)%0A      + key_pair_id     = (known after apply)%0A      + public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDnr0IBON5DDI8avy+YCZVZjRhmlMeW8gU/5RBJVOhhCMk7sRI6zQKJ0eDZfe3UGn1Bn1A18Pyuv/hUR8PUPZTLbXqZAtTJ0PySQotrAi3qvZXp68NU8IAZljVC7uZ2O8ipk9jkbHLxrMk4K0j/7yN4t1C5ReXrCH7XwSh241ibS6KJnmFnqK1QuENS7FC8JlseRr/FRN4b69ekAE1YeNt2TmC4NQndePNd8uzQB2ZAmklsLF35zAr63H7PEVZSRxO1AVMeqVp+DvySs7eBFqw+GmnLaHrqUA6xnr/uRZ+eB4/TiP4embxHEZlX9O6t7DPquxYaprE697ISG/VZ/OkO8gpOSyVYkchd0wH1a0EC1cxkbTlgO4kTgzFj3tpPuQwvd913gsmAE+Y1w5h1Zc/0dHsu1U7xtf8HnIaplTPtZVfG3MLKsTROqU207oT9S+2waVr4I21mgvzsJP6cIXH2KhJPG17zXUcM+cnRyoXedkZZuqNRP2lBAtjkWyBCbU8= fu-haojie@fu-haojies-MacBook-Pro.local"%0A      + tags            = {%0A          + "Environment" = "Test"%0A          + "Name"        = "week7-dev-keypair"%0A          + "Owner"       = "ACS730"%0A          + "Project"     = "Ansible"%0A        }%0A      + tags_all        = {%0A          + "Environment" = "Test"%0A          + "Name"        = "week7-dev-keypair"%0A          + "Owner"       = "ACS730"%0A          + "Project"     = "Ansible"%0A        }%0A    }%0A%0A  # module.linux_sg.aws_security_group.default[0] will be created%0A  + resource "aws_security_group" "default" {%0A      + arn                    = (known after apply)%0A      + description            = "Managed by Terraform"%0A      + egress                 = (known after apply)%0A      + id                     = (known after apply)%0A      + ingress                = (known after apply)%0A      + name                   = "primary"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Attributes"  = "primary"%0A          + "Environment" = "Test"%0A          + "Name"        = "week7-dev-LinuxServer-sg"%0A          + "Owner"       = "ACS730"%0A          + "Project"     = "Ansible"%0A        }%0A      + tags_all               = {%0A          + "Attributes"  = "primary"%0A          + "Environment" = "Test"%0A          + "Name"        = "week7-dev-LinuxServer-sg"%0A          + "Owner"       = "ACS730"%0A          + "Project"     = "Ansible"%0A        }%0A      + vpc_id                 = "vpc-01a65784cedcde8cb"%0A%0A      + timeouts {%0A          + create = "10m"%0A          + delete = "15m"%0A        }%0A    }%0A%0A  # module.linux_sg.aws_security_group_rule.keyed["HTTP"] will be created%0A  + resource "aws_security_group_rule" "keyed" {%0A      + cidr_blocks              = [%0A          + "0.0.0.0/0",%0A        ]%0A      + description              = "Allow HTTP from anywhere"%0A      + from_port                = 80%0A      + id                       = (known after apply)%0A      + prefix_list_ids          = []%0A      + protocol                 = "tcp"%0A      + security_group_id        = (known after apply)%0A      + self                     = false%0A      + source_security_group_id = (known after apply)%0A      + to_port                  = 80%0A      + type                     = "ingress"%0A    }%0A%0A  # module.linux_sg.aws_security_group_rule.keyed["_allow_all_egress_"] will be created%0A  + resource "aws_security_group_rule" "keyed" {%0A      + cidr_blocks              = [%0A          + "0.0.0.0/0",%0A        ]%0A      + description              = "Allow all egress"%0A      + from_port                = 0%0A      + id                       = (known after apply)%0A      + ipv6_cidr_blocks         = [%0A          + "::/0",%0A        ]%0A      + prefix_list_ids          = []%0A      + protocol                 = "-1"%0A      + security_group_id        = (known after apply)%0A      + self                     = false%0A      + source_security_group_id = (known after apply)%0A      + to_port                  = 0%0A      + type                     = "egress"%0A    }%0A%0A  # module.linux_sg.aws_security_group_rule.keyed["ssh"] will be created%0A  + resource "aws_security_group_rule" "keyed" {%0A      + cidr_blocks              = [%0A          + "0.0.0.0/0",%0A        ]%0A      + description              = "Allow SSH from anywhere"%0A      + from_port                = 22%0A      + id                       = (known after apply)%0A      + prefix_list_ids          = []%0A      + protocol                 = "tcp"%0A      + security_group_id        = (known after apply)%0A      + self                     = false%0A      + source_security_group_id = (known after apply)%0A      + to_port                  = 22%0A      + type                     = "ingress"%0A    }%0A%0APlan: 7 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + ips = [%0A      + (known after apply),%0A      + (known after apply),%0A    ]%0A
::debug::stderr: 
::debug::exitcode: 0

  ```
  </details>
  *Pusher: @gilfoylegpt, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform - Staging`*